Documents/ИнвентаризацияОстатковУПоставщика_СД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ИнвентаризацияОстатковУПоставщика_СД</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСоСкидкой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазницаСумм</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураПоставщика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураПоставщика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазницаКоличества</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоговораКонтрагента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ИнвентаризацияОстатковУПоставщика_СД/Ext/ObjectModule.bsl
Перем мВалютаРегламентированногоУчета Экспорт;

#Если Клиент Тогда
// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	Если ЭтоНовый() Тогда
		Предупреждение("Документ можно распечатать только после его записи");
		Возврат;
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
		Возврат;
	КонецЕсли;

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	// Получить экземпляр документа на печать
	Если ИмяМакета = "ИнвентаризацияОстатковУПоставщика" Тогда
		ТабДокумент = ПечатьИнвентаризацииОстатковУПоставщика();
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, Строка("")));

КонецПроцедуры // Печать()

Функция ПечатьИнвентаризацииОстатковУПоставщика()

	ТабДокумент  = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияОстатковУПоставщика_СД_ИнвентаризацияОстатковУПоставщика";
	Макет       = ПолучитьМакет("ИнвентаризацияОстатковУПоставщика");
	КодЯзыкаПечать = "uk";
	

	// Выводим титульный лист авансового отчета
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	//ОбластьМакета.Параметры.НомерДок = Номер;
	ОбластьМакета.Параметры.ДатаДок  = Формат(Дата, "ДФ=dd.MM.yyyy");
	ОбластьМакета.Параметры.НомерДок  = ОбщегоНазначения.ПолучитьНомерНаПечать(ЭтотОбъект);
	ОбластьМакета.Параметры.Контрагент  = Контрагент.НаименованиеПолное;
	ОбластьМакета.Параметры.ДоговорКонтрагента  = ?(СокрЛП(ДоговорКонтрагента.НаименованиеДляПечати) <> "", ДоговорКонтрагента.НаименованиеДляПечати, ДоговорКонтрагента.Наименование);
	ТабДокумент.Вывести(ОбластьМакета);

	// Выводим табличные части
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	НомерСтроки   = 0;

	ИтогоКоличествоПлан    = 0;
	ИтогоКоличество        = 0;
	ИтогоРазницаКоличества = 0;
	ИтогоСуммаПлан         = 0;
	ИтогоСумма             = 0;
	ИтогоРазницаСумм       = 0;
	
	ЗапросТовары = Новый Запрос;
	ЗапросТовары.УстановитьПараметр("ТекущийДокумент", Ссылка);
	ЗапросТовары.Текст = "ВЫБРАТЬ
	                     |	ИнвентаризацияОстатковУПоставщика_СДТовары.Номенклатура,
	                     |	ИнвентаризацияОстатковУПоставщика_СДТовары.КоличествоПлан,
	                     |	ИнвентаризацияОстатковУПоставщика_СДТовары.Количество,
	                     |	ИнвентаризацияОстатковУПоставщика_СДТовары.ЦенаСоСкидкой,
	                     |	ИнвентаризацияОстатковУПоставщика_СДТовары.СуммаПлан,
	                     |	ИнвентаризацияОстатковУПоставщика_СДТовары.Сумма,
	                     |	ИнвентаризацияОстатковУПоставщика_СДТовары.РазницаСумм,
	                     |	ИнвентаризацияОстатковУПоставщика_СДТовары.РазницаКоличества
	                     |ИЗ
	                     |	Документ.ИнвентаризацияОстатковУПоставщика_СД.Товары КАК ИнвентаризацияОстатковУПоставщика_СДТовары
	                     |ГДЕ
	                     |	ИнвентаризацияОстатковУПоставщика_СДТовары.Ссылка = &ТекущийДокумент";

	Товар = ЗапросТовары.Выполнить().Выбрать();
	
	Пока Товар.Следующий() Цикл

		ОбластьМакета.Параметры.Заполнить(Товар);
		
		НомерСтроки = НомерСтроки + 1;
		
		ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;

		ИтогоКоличествоПлан    = ИтогоКоличествоПлан + Товар.КоличествоПлан;
		ИтогоКоличество        = ИтогоКоличество + Товар.Количество;
		ИтогоРазницаКоличества = ИтогоРазницаКоличества + Товар.РазницаКоличества;
		ИтогоСуммаПлан         = ИтогоСуммаПлан + Товар.СуммаПлан;
		ИтогоСумма             = ИтогоСумма + Товар.Сумма;
		ИтогоРазницаСумм       = ИтогоРазницаСумм + Товар.РазницаСумм;

		ТабДокумент.Вывести(ОбластьМакета);

	КонецЦикла;

	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	ОбластьМакета.Параметры.ИтогоКоличествоПлан    = ИтогоКоличествоПлан;
	ОбластьМакета.Параметры.ИтогоКоличество        = ИтогоКоличество;
	ОбластьМакета.Параметры.ИтогоРазницаКоличества = ИтогоРазницаКоличества;
	ОбластьМакета.Параметры.ИтогоСуммаПлан		   = ИтогоСуммаПлан;
	ОбластьМакета.Параметры.ИтогоСумма             = ИтогоСумма;
	ОбластьМакета.Параметры.ИтогоРазницаСумм       = ИтогоРазницаСумм;
	ТабДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабДокумент;

КонецФункции // ПечатьАвансовогоОтчета()

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт

	СтруктураМакетов = Новый Структура;
	СтруктураМакетов.Вставить("ИнвентаризацияОстатковУПоставщика",    "Инвентаризация остатков у поставщика");

	Возврат СтруктураМакетов;

КонецФункции // ПолучитьТаблицуПечатныхФорм()

















мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
